const userAgreementContent = `油惠侠提供的各项服务的所有权和运作权均归杭州顾释科技有限公司（ 以下简称“ 油惠侠”） 所有。 油惠侠用户使用协议（ 以下简称“ 本协议”） 系由油惠侠用户与油惠侠就油惠侠APP的各项服务所订立的相关权利义务规范。 用户使用油惠侠APP， 即表示接受并同意本协议的所有条件和条款。 油惠侠作为油惠侠APP的运营者依据本协议为用户提供服务。

油惠侠有权对本协议条款进行修改， 修改后的协议一旦公布即有效代替原来的协议。 用户可随时查阅最新协议。

《知识产权声明》 为本协议不可分割的组成部分。

用户参与油惠侠APP使用时， 须遵守使用规则， 不得恶意破坏泄露APP及相关网站数据。

一、 协议声明

1. 油惠侠APP通过互联网依法为用户提供油卡充值、 订单查询 等服务, 用户在完全同意本协议及油惠侠规定的情况下, 方有权使用油惠侠的油卡充值服务。

2. 您在注册后, 即视为您已阅读、 了解并完全同意本协议的各项内容, 并具有独立承担法律责任的能力。

3. 油惠侠APP在必要时可修改本协议, 并在油惠侠软件上进行公告, 即公告之日起生效。 如您继续使用油卡充值服务, 则视 为您已接受修订的充值协议。

二、 服务说明

1. 油惠侠加油卡充值服务仅支持中国石油发行的个人记名卡主卡和中国石化多用户卡中的主卡和单用户卡。

2. 中石化油卡不支持增值税发票类型的单位卡、 副卡、 不记名卡的充值。

3. 中石油昆合卡不支持副卡、 司机卡、 失效卡、 不记名卡、 过期卡的充值。

4. 充值完成后请您携加油卡到中国石油、 中国石化任意发卡充值网点, 将油卡充值资金圈存到加油卡中, 即可使用充值 资金。

5. 中石化油卡不支持增值税发票类型的单位卡、 副卡、 不记名卡的充值。

6. 如有疑问, 请咨询客服热线 400-8170-777。

三、 免责条款

油惠侠app不承担责任, 包括但不仅限于:

1. 因不可抗力、 系统故障、 通讯故障、 网络拥堵、 供电系统故障、 恶意攻击等造成油惠侠未能及时、 准确、 完整地提供油卡充值服务。

2. 如用户利用系统差错、 故障或其他原因导致的漏洞, 损害油惠侠的权益, 油惠侠将中止为该用户提供油卡充值服务, 并保留法律追究的权利。

3. 油惠侠负责对油惠侠上的信息进行审核与更新, 但并不就信息的时效性、 准确性以及服务功能的完整性和可靠性承 担任何义务和赔偿责任。

5. 服务一定能符合您的要求； 服务不会受中断； 服务的安全性、 及时性、 完整性和准确性。

6. 车主应妥善保管帐户、 密码等信息资料, 非因油惠侠原因造成您的用户信息泄露, 由此给您帯来的损失油惠侠不承担 任何责任。

7. 您在使用油惠侠服务时， 因个人原因产生的损失， 油惠侠不承担任何责任。

四、 用户信息的保密

1、 本协议所称之油惠侠用户信息是指符合法律、 法规及相关规定， 并符合下述范围的信息：

（1） 用户注册油惠侠或申请油惠侠， 提供的个人信息.

（2） 油惠侠从商业伙伴处合法获取的用户个人信息；

（3） 其它油惠侠APP通过合法途径获取的用户个人信息。

2、 油惠侠承诺： 非经法定原因或用户事先许可， 油惠侠不会向任何第三方透露用户的密码、 姓名、 手机号码等非公开信息

3、 在下述法定情况下， 用户的个人信息将会被部分或全部披露：

（1） 经用户同意向用户本人或其他第三方披露；

（2） 根据法律、 法规等相关规定， 或行政机构要求， 向行政、 司法机构或其他法律规定的第三方披露；

五、 用户权利

1、 用户的密码和安全性

（1） 用户有权选择是否成为油惠侠注册用户。 用户使用应遵守相关法律法规并符合网络道德。 用户名和昵称中不能含有任何侮辱、 威胁、 淫秽、 谩骂等侵害他人合法权益的文字。

（2） 用户一旦注册成功， 将得到油惠侠账户和密码， 并对以此组账户和密码登入系统后所发生的所有活动和事件负责， 自行承担一切使用该账号的言语、 行为等而直接或者间接导致的法律责任。

（3） 用户有义务妥善保管油惠侠的账户和密码， 用户将对账户和密码安全负全部责任。 因用户原因导致账户或密码泄露而造成的任何法律后果由用户本人负责。

（4） 用户密码遗失的， 可以通过注册页面申请重置密码， 以手机号码注册的用户可以凭借手机号码找回原密码。 用户若发现任何非法使用用户名或存在其他安全漏洞的情况， 应立即告知油惠侠。

（5） 本公司提供的油卡充值业务仅为代充业务， 不提供发票。

六、 适用法律和裁判地点

1、 因用户使用油惠侠而引起或与之相关的一切争议、 权利主张或其它事项， 均受中华人民共和国法律的管辖。

2、 用户和油惠侠发生争议的， 应首先本着诚信原则通过协商加以解决。 如果协商不成， 则应向互文所在地人民法院提起诉讼。

七、 可分性 如果本协议的任何条款被视为不合法、 无效或因任何原因而无法执行， 则此等规定应视为可分割， 不影响任何其它条款的法律效力。

八、 冲突选择 本协议是油惠侠与用户注册成为油惠侠用户， 使用油惠侠及相关网站服务之间的重要法律文件， 油惠侠或者用户的任何其他书面或者口头意思表示与本协议不一致的， 均应当以本协议为准。

九、 特别提醒 鉴于：《 中华人民共和国合同法》 第39条规定： 采用格式条款订立合同的， 提供格式条款的一方应当遵循公平原则确定当事人之间的权利和义务， 并采取合理的方式提请对方注意免除或者限制其责任的条款， 按照对方的要求， 对该条款予以说明。 鉴于油惠侠已依法明确了上述条款、 履行了格式条款制订方的义务， 用户点击立即注册或使用油惠侠各项服务， 将被视为且应当被视为用户已经完全注意并同意了本合同所有条款尤其是提醒用户注意的条款的合法性及有效性， 用户不应当以油惠侠对格式条款以合理方式提醒用户注意或未根据用户要求尽到说明义务为理由而声称或要求法院或其它任何第三方确认相关条款非法或无效。

杭州顾释科技有限公司 `.replace(/\n/g, '<br/>')
// .replace(/###(.*?)\n/g, '<h3>$1</h3>\n')

export {
  userAgreementContent
}